{
  "general": {
    "imgUrl": "https://media.licdn.com/dms/image/C4E03AQEEfsAETFOhFA/profile-displayphoto-shrink_200_200/0?e=1577318400&v=beta&t=0QXobRHKP3wB35g7ufKTLcpdICqsQU3p4HlSJO4f5Oo",
    "fullName": "Lee Stott",
    "headline": "Senior Program Manager",
    "company": "Microsoft",
    "location": "United Kingdom",
    "connections": "500+ connections",
    "profileUrl": "https://www.linkedin.com/in/leestott/#",
    "connectionDegree": "3rd",
    "vmid": "ACoAAACokwoBXU0oCR_j_Fcu2iJYLmkWJNDyioE",
    "linkedinSalesNavigatorUrl": "https://www.linkedin.com/sales/people/ACoAAACokwoBXU0oCR_j_Fcu2iJYLmkWJNDyioE,name",
    "description": "An experienced business technology leader with extensive Data Science, Mobile and Cloud industry knowledge. Now applying that experience to help Microsoft engage with developers and strategic decision makers across the world as part of Microsoft Cloud and AI Engineering team.Throughout my career I have held positions in both commercial and academic market providing both internally managed and partnered services and solutions. I have successfully lead both services and delivery teams in both the commercial and academic markets which have had to deal with the same challenges of communications, engagement, competition, cultural change management and strategic leadership.Specialties: Developer Tools and Platform,Higher Education Sector, Student and Academic Services,  Mobile Applications, Data Science, Cloud Services,Collaboration & Devices.",
    "subscribers": "3802",
    "firstName": "Lee",
    "lastName": "Stott"
  },
  "jobs": [
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "Senior Program Manager Data Science",
      "dateRange": "Feb 2019 – Present",
      "location": "World Wide",
      "description": "Senior Program Manager within the Academic Ecosystems team which sits in the Microsoft Cloud + AI organization. Our global team helps enable developers to do what they love; write, code, and learn.  Specifically, our teams in focused on inspiring tomorrow’s influential computer science faculty and students with Azure and the open source that runs on it. \n\nResponsibilities include:\n•\tInteracting with faculty and students at universities to understand their needs, preferences, and perspectives on data science and how Microsoft products are used in the data science community.\n•\tDeveloping strategy and solutions for how Microsoft reaches the next generation of data scientists.  product engineering to deliver insight and actionable product feedback.\n•\tBuilding strategic partnerships with educational publishers, MOOCs, student organizations, along with open source communities as they pertain to data science leading to advocacy and impact on behalf of Microsoft.\n•\tLead the development of our technical content and library of programmatic course solutions in data science which may include courseware, workshops and labs, tech talks, blogs, and online learning.\n•\tLeading cross-company technical v-teams ensuring quality delivery."
    },
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "Senior Software Engineer",
      "dateRange": "Jul 2018 – Present",
      "location": "EMEA",
      "description": "Lee is a member of the Microsoft Commercial Software Engineering group. The  group enables high-impact customers and partners to achieve more and drive the value of our intelligent cloud and edge. Developing projects services, solutions, process and patterns, that can be deployed by Microsoft customers to solve current and emerging challenges.\nResponsible for:\nWork with high-impact customers and partners to identify key business and technology opportunities\nDrive early technology programs by working with innovative companies to adopt key emerging capabilities of Microsoft Azure\nWork closely with the Microsoft engineering groups to provide feedback to influence the future product roadmap\nDeliver showcase uses of Microsoft Azure and Microsoft technology Solutions.\nScope real world projects, architect solutions, resolve issues and deliver business value to the customer\nEnsure synchronization between Microsoft teams to meet the project requirements\n\nDemonstrable experience and expertise designing and delivering commercially-competitive software using modern software engineering practices and modern cloud architectures.\nStrong business acumen and track record of building technical and business relationships \nProven ability to influence and integrate with CxOs and navigate competitive situations\nDemonstrated ability to work with customers to extract specific business goals and requirements and translate those requirements into solutions to meet customer goals and objectives\nGreat communication and presentation skills including public speaking at industry events\nAn entrepreneurial mind-set which fosters an environment of creativity and inspires innovation and risk taking.\nExtensive experience of software development practices and a track record of working closely with large development teams\nResults driven with strong analytical skills and exceptional verbal and written communications skill\nExtensive experience at public speaking at industry events"
    },
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "EMEA Leader (Acting) Academic Engagements",
      "dateRange": "Mar 2018 – Jul 2018",
      "location": "EMEA",
      "description": "Lee’s role is all about working with Academia across EMEA  to secure the future of the Microsoft platform. Focused on deep technical engineering engagement and activities for both educators and Industrial Project initiative with UG and PG students. Working across Microsoft Product and Engineering teams and Microsoft Partners teams to support and develop Engineering patterns and processes."
    },
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "Technical Evangelist Gaming/Academic Engagements UK",
      "dateRange": "Jul 2016 – Mar 2018",
      "location": "United Kingdom",
      "description": "Lee Stott is a Technical Evangelist within Microsoft DX group. Lee’s role is all technical lead of UK Academic Engagements securing the future of Microsoft platform with UK Academic institutions, Lee's focus is on Microsoft Cloud, Microsoft OpenSource and Microsoft Developer Tools including VSTS, Visual Studio and Visual Studio Code. Lee’s role is focused on Cross Platform development, Azure cloud services and development of patterns and practices which can be opensourced and shared across the academic community. The core of this role is around working closely with academics and educators in relation to curricula and resource development for sharing at http://github.com/msftimagine/computerscience and services such as Imagine Access and Azure for students. Lee works closely with academics and students throughout the UK, helping them use the breadth and depth of the technologies and services on Microsoft’s platforms to enhance their academic projects and courses."
    },
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "Technical Evangelist - Game Development",
      "dateRange": "Mar 2014 – Jul 2016",
      "location": "United Kingdom",
      "description": "Lee Stott is a Technical Evangelist within Microsoft Developer & Platform Evangelism group. Lee’s role is all about working with Game developers to secure the future of Microsoft platform, powered by the Microsoft Cloud and built with Microsoft Tools and services. Lee’s role is focused on game development using Unity3d, Marmalade, Unreal, GameMaker and C++/DirectX for Windows and Xbox. The core of this role is around the UK gaming industry and partners. Lee works closely with UK and National bodies include UKIE, TIGA and the development community from indies to large studio developers. Helping them use the breadth and depth of the technologies and services on Microsoft’s platforms to make their games awesome."
    },
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "Technical Evangelist",
      "dateRange": "Jul 2012 – Mar 2014",
      "location": null,
      "description": "Lee Stott is a Technical Evangelist within Microsoft Developer & Platform Evangelism group. Lee’s role is all about working with technical people to secure the future of the Microsoft platform, powered by the Microsoft Cloud and built with Microsoft Tools. Lee’s role is focused on Windows Phone, Windows  and Windows Azure. The core of this role is around the UK gaming industry and UK Academia. Lee works closely with academics, students, indie and studio developers throughout the UK, helping them use the breadth and depth of the technologies and services on Microsoft’s platforms to make their games awesome.\n\nMicrosoft Ltd, DPE (Developer & Platform Evangelism group) is all about working with technical people to secure the future of the Microsoft platform by winning Applications on all Microsoft devices, powered by the Microsoft Cloud, and build on Microsoft Tools.\n\nThe role involves in-person 1:1 engagements with a particular customer or can stretch to larger scale activities like educational workshops, developer sessions at conferences and also online mechanisms like training videos and blogs.\n\nLee has spoken to large (10-1500) developer audiences about these technologies at various events and conferences."
    },
    {
      "companyName": "Microsoft",
      "companyUrl": "https://www.linkedin.com/company/microsoft/",
      "jobTitle": "Academic Evangelist",
      "dateRange": "Mar 2011 – Jul 2012",
      "location": null,
      "description": "Lee Stott is a UK Academic Evangelist within the Developer and Platform Evangelism 'DPE' Group at Microsoft UK. http://www.microsoft.com/uk/faculty  \n\nHe is responsible for engaging and helping UK Academia understand how Microsoft technologies and services can help complement existing strategies within teaching, learning and research. He has over 10 years of experience within the UK HE educational sector and is a Chartered IT Professional member of the BCS.\n \nHe is currently responsible for Microsoft Curriculum adoption:- http://www.microsoft.com/faculty and Microsoft DreamSpark http://www.dreamspark.com DreamSpark provides professional-level developer and design tools to students and educators at no charge. The Microsoft Developer toolsets help advance learning and skills through STEM-D. Science, technology, engineering, math and design activities.\n\nDreamSpark simply allows Institutions to gain a huge advantage in offering added value to the students experiences and overall satisfaction. The DreamSpark premium package gives access to £k of pounds of software to each student at very little £ investment by the institution.\n\nSkills and capabilities\n\n- Broad community engagement and satisfaction \n- Academic technical evangelism and curriculum adoption \n- Adoption of Microsoft platform technologies\n- Broad technical enablement of the Microsoft partner community\n- Drive broad developer excitement in community with VS .Net and MS platform. \n- Present at 1-to-many events and Microsoft events. \n- Act as a technical resource for products and technology for customers and partners. \n- Provide technical and process planning and guidance to customers."
    },
    {
      "companyName": "Birmingham City University",
      "companyUrl": "https://www.linkedin.com/company/birmingham-city-university/",
      "jobTitle": "Computer Science Advisory Board Member",
      "dateRange": "Aug 2017 – Present",
      "location": null,
      "description": "Computer Science Advisory Board Member\n\nPrincipal aims being:\nTo strengthen and develop the school's engagement with industry at all levels, including teaching, research, student projects and careers advice\nTo review existing degree programmes within the school, in terms of the extent to which they prepare students for careers in industry\nTo identify new and existing directions in industry that could be incorporated into the school's degree programmes \n\nPrincipal aims being:\nTo strengthen and develop the school's engagement with industry at all levels, including teaching, research, student projects and careers advice\nTo review existing degree programmes within the school, in terms of the extent to which they prepare students for careers in industry\nTo identify new and existing directions in industry that could be incorporated into the school's degree programmes"
    },
    {
      "companyName": "Durham University",
      "companyUrl": "https://www.linkedin.com/company/durham-university/",
      "jobTitle": "Computer Science Advisory Board Member",
      "dateRange": "Sep 2016 – Present",
      "location": "Durham",
      "description": "Principal aims being:\nTo strengthen and develop the school's engagement with industry at all levels, including teaching, research, student projects and careers advice\nTo review existing degree programmes within the school, in terms of the extent to which they prepare students for careers in industry\nTo identify new and existing directions in industry that could be incorporated into the school's degree programmes"
    },
    {
      "companyName": "Cardiff Metropolitan University",
      "companyUrl": "https://www.linkedin.com/company/cardiff-metropolitan-university/",
      "jobTitle": "Computer Science Advisory Board Member",
      "dateRange": "Feb 2014 – Present",
      "location": null,
      "description": "Principal aims being:\nTo strengthen and develop the school's engagement with industry at all levels, including teaching, research, student projects and careers advice\nTo review existing degree programmes within the school, in terms of the extent to which they prepare students for careers in industry\nTo identify new and existing directions in industry that could be incorporated into the school's degree programme"
    },
    {
      "companyName": "STARS The University Of Manchester",
      "companyUrl": "https://www.linkedin.com/company/university-of-manchester/",
      "jobTitle": "Head of Information Systems",
      "dateRange": "Jan 2007 – Mar 2011",
      "location": null,
      "description": "With more than 10 years of experience and chartered status, in the Information Technology and Services arena. I have established a long and successful track record of the successful ICT implementation.\n\nAdditionally I have had financial management responsibility for variety of services and solutions including:-\n \n(i) Bespoke services and software solutions \n\n(ii) Internal managed services and solutions \n\n(iii) Outsourced managed services and relationship management\n\n(iv) Partnered services in respect to the accommodation and facilities management sector.\n\nThroughout my career I have strived of excellence and conducted business successfully supporting and negotiating with various staff at all levels. \n\nI have the necessary business acumen, management experience and technological skills, with strong academic background and a solid appreciation of technology and services to ensure the successful deliver of all service's and solutions.\n\nSpecialties\n\nHigher Education Sector, Student and Academic Services, \n Commercial and Residential Fixed Internet Solutions and Design,\n Commercial Wireless Services & Partnership,\n Mobile Applications, \n Collaboration & Devices,\n Telecom's & Data Services, \n ITIL Service Management,\n Project Management - PRINCE 2,\n SOA - Service-Oriented Architecture, \n TOGAF"
    },
    {
      "companyName": "The University of Manchester",
      "companyUrl": "https://www.linkedin.com/search/results/index/?keywords=The%20University%20of%20Manchester",
      "jobTitle": "IT Manager, STARS",
      "dateRange": "Oct 2004 – Jan 2007",
      "location": null,
      "description": null
    },
    {
      "companyName": "UMIST, Trading Services",
      "companyUrl": "https://www.linkedin.com/search/results/index/?keywords=UMIST%2C%20Trading%20Services",
      "jobTitle": "IS Manager",
      "dateRange": "Sep 1998 – Oct 2004",
      "location": null,
      "description": null
    },
    {
      "companyName": "Transputec Computers Plc - Microsoft Solutions Gold Reseller",
      "companyUrl": "https://www.linkedin.com/search/results/index/?keywords=Transputec%20Computers%20Plc%20-%20Microsoft%20Solutions%20Gold%20Reseller",
      "jobTitle": "Web Development Manager",
      "dateRange": "Feb 1996 – Sep 1998",
      "location": null,
      "description": null
    },
    {
      "companyName": "Chartered Institue of Building",
      "companyUrl": "https://www.linkedin.com/search/results/index/?keywords=Chartered%20Institue%20of%20Building",
      "jobTitle": "IT Consultant",
      "dateRange": "Jan 1996 – Feb 1997",
      "location": null,
      "description": null
    }
  ],
  "schools": [
    {
      "schoolUrl": "https://www.linkedin.com/school/12721/?legacySchoolId=12721",
      "schoolName": "University of Southampton",
      "degree": "PGCE",
      "degreeSpec": "Higher Education Management",
      "dateRange": "2006 – 2007"
    },
    {
      "schoolUrl": "https://www.linkedin.com/school/12709/?legacySchoolId=12709",
      "schoolName": "University of Liverpool",
      "degree": "MSc",
      "degreeSpec": "Information Technology",
      "dateRange": "2006"
    }
  ],
  "details": {
    "linkedinProfile": "https://www.linkedin.com/in/leestott",
    "websites": "microsoft.com/uk/faculty",
    "twitter": "lee_stott"
  },
  "skills": [
    {
      "name": "Cloud Computing",
      "endorsements": "99+"
    },
    {
      "name": "Mobile Applications",
      "endorsements": "81"
    },
    {
      "name": "IT Management",
      "endorsements": "70"
    },
    {
      "name": "ITIL",
      "endorsements": "59"
    },
    {
      "name": "Software Development",
      "endorsements": "42"
    },
    {
      "name": "IT Service Management",
      "endorsements": "38"
    },
    {
      "name": "Strategy",
      "endorsements": "32"
    },
    {
      "name": "Software Project Management",
      "endorsements": "18"
    },
    {
      "name": "IT Strategy",
      "endorsements": "18"
    },
    {
      "name": "Higher Education",
      "endorsements": "17"
    },
    {
      "name": "SOA",
      "endorsements": "15"
    },
    {
      "name": "Mobile Devices",
      "endorsements": "12"
    },
    {
      "name": "Software Engineering",
      "endorsements": "11"
    },
    {
      "name": "Gaming Industry",
      "endorsements": "9"
    },
    {
      "name": "Project Management",
      "endorsements": "4"
    },
    {
      "name": "Enterprise Architecture",
      "endorsements": "3"
    },
    {
      "name": "Agile Project Management",
      "endorsements": "3"
    },
    {
      "name": "Change Management",
      "endorsements": "2"
    },
    {
      "name": "Business Intelligence",
      "endorsements": "2"
    },
    {
      "name": "Agile Methodologies",
      "endorsements": "2"
    },
    {
      "name": "Architecture",
      "endorsements": "1"
    },
    {
      "name": "Game Development",
      "endorsements": "1"
    },
    {
      "name": "Information Technology",
      "endorsements": "1"
    },
    {
      "name": "Integration",
      "endorsements": "1"
    },
    {
      "name": "Outsourcing",
      "endorsements": "1"
    },
    {
      "name": "Scrum",
      "endorsements": "1"
    },
    {
      "name": "Software Design",
      "endorsements": "1"
    },
    {
      "name": "Solution Architecture",
      "endorsements": "1"
    },
    {
      "name": "Microsoft Technologies",
      "endorsements": "66"
    },
    {
      "name": ".NET",
      "endorsements": "31"
    },
    {
      "name": "Microsoft SQL Server",
      "endorsements": "21"
    },
    {
      "name": "C#",
      "endorsements": "20"
    },
    {
      "name": "Microsoft Products",
      "endorsements": "9"
    },
    {
      "name": ".NET Framework",
      "endorsements": "4"
    },
    {
      "name": "SharePoint",
      "endorsements": "3"
    },
    {
      "name": "Windows 8",
      "endorsements": "2"
    },
    {
      "name": "Enterprise Software",
      "endorsements": "1"
    },
    {
      "name": "Databases",
      "endorsements": "1"
    },
    {
      "name": "ASP.NET",
      "endorsements": "1"
    },
    {
      "name": "Hyper-V",
      "endorsements": "1"
    },
    {
      "name": "IIS",
      "endorsements": "1"
    },
    {
      "name": "Linux",
      "endorsements": "1"
    },
    {
      "name": "Microsoft Azure",
      "endorsements": "1"
    },
    {
      "name": "SaaS",
      "endorsements": "1"
    },
    {
      "name": "Azure",
      "endorsements": "0"
    },
    {
      "name": "Management",
      "endorsements": "7"
    },
    {
      "name": "Leadership",
      "endorsements": "2"
    },
    {
      "name": "Windows Phone",
      "endorsements": "12"
    },
    {
      "name": "Gaming",
      "endorsements": "9"
    }
  ],
  "allSkills": "Cloud Computing, Mobile Applications, IT Management, ITIL, Software Development, IT Service Management, Strategy, Software Project Management, IT Strategy, Higher Education, SOA, Mobile Devices, Software Engineering, Gaming Industry, Project Management, Enterprise Architecture, Agile Project Management, Change Management, Business Intelligence, Agile Methodologies, Architecture, Game Development, Information Technology, Integration, Outsourcing, Scrum, Software Design, Solution Architecture, Microsoft Technologies, .NET, Microsoft SQL Server, C#, Microsoft Products, .NET Framework, SharePoint, Windows 8, Enterprise Software, Databases, ASP.NET, Hyper-V, IIS, Linux, Microsoft Azure, SaaS, Azure, Management, Leadership, Windows Phone, Gaming",
  "query": "https://www.linkedin.com/in/leestott/"
}
